OpenFOAM-pimpleFOAM-Rectangular_Cylinder-main/OpenFOAM-pimpleFOAM-Rectangular_Cylinder-main/OpenFOAM/case1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-3;

boundaryField
{
    wall1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	
	wall2
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	
	cylinder
    {
        type            kqRWallFunction;
        value           $internalField;
    }
	
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           $internalField;
    }
    
	outlet
    {
        type            zeroGradient;
    }
    
	defaultFaces
    {
        type            empty;
    }

}


// ************************************************************************* //
